In [1]:
2+2

4

In [2]:
2022^100

1922

In [3]:
pow(2022, 100)

3785429179428935073363062815491169327123065324423181387778241312746148163739509529963384852878486050536268703697739453552074100730542245720682274118391426137345969268076934125483463741803259450343989556154926288784954516684170406795181910501926920899679396230965918243396489708036356923022692614618900548171952319994377590198501376

In [4]:
read_cvs

NameError: name 'read_cvs' is not defined

In [5]:
data= pd.read_csv("titanic.csv")

NameError: name 'pd' is not defined

In [6]:
data= pd.read_csv("titanic.csv")

NameError: name 'pd' is not defined

In [7]:
data = pd.read_csv("titanic.csv")
data

NameError: name 'pd' is not defined

In [11]:
import pandas as pd
data = pd.read_csv("titanic.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [13]:
data.shape

(891, 12)

In [14]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [15]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [16]:
serie

NameError: name 'serie' is not defined

In [17]:
data[["Survived", "Age", "Name"]]

     Survived   Age                                               Name
0           0  22.0                            Braund, Mr. Owen Harris
1           1  38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1  26.0                             Heikkinen, Miss. Laina
3           1  35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4           0  35.0                           Allen, Mr. William Henry
..        ...   ...                                                ...
886         0  27.0                              Montvila, Rev. Juozas
887         1  19.0                       Graham, Miss. Margaret Edith
888         0   NaN           Johnston, Miss. Catherine Helen "Carrie"
889         1  26.0                              Behr, Mr. Karl Howell
890         0  32.0                                Dooley, Mr. Patrick

[891 rows x 3 columns]

In [18]:
serie

NameError: name 'serie' is not defined

In [19]:
serie["b": "e"]

NameError: name 'serie' is not defined

In [20]:
data["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [21]:
serie["d"]

NameError: name 'serie' is not defined

In [22]:
data.loc[3, "Name"]

'Futrelle, Mrs. Jacques Heath (Lily May Peel)'

In [23]:
data.loc[25:30, "PassengerId": "Pclass"]

    PassengerId  Survived  Pclass
25           26         1       3
26           27         0       3
27           28         0       1
28           29         1       3
29           30         0       3
30           31         0       1

In [24]:
data.iloc[10:18, -3:]

       Fare Cabin Embarked
10  16.7000    G6        S
11  26.5500  C103        S
12   8.0500   NaN        S
13  31.2750   NaN        S
14   7.8542   NaN        S
15  16.0000   NaN        S
16  29.1250   NaN        Q
17  13.0000   NaN        S

In [25]:
data.iloc[125,4]

'male'

In [26]:
data.iloc[[25,30], [2,5]]

    Pclass   Age
25       3  38.0
30       1  40.0

In [28]:
data[data["Age"]>= 30]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [30]:
data.loc[data["Age"]>= 30, ["Name", "Sex"]]

                                                  Name     Sex
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
6                              McCarthy, Mr. Timothy J    male
11                            Bonnell, Miss. Elizabeth  female
..                                                 ...     ...
873                        Vander Cruyssen, Mr. Victor    male
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female
881                                 Markun, Mr. Johann    male
885               Rice, Mrs. William (Margaret Norton)  female
890                                Dooley, Mr. Patrick    male

[330 rows x 2 columns]

In [31]:
df

NameError: name 'df' is not defined

In [33]:
import dataframe as df
df

ModuleNotFoundError: No module named 'dataframe'

In [34]:
df.index = ["fila 1", "fila 2", "fila 3", "fila 4"]
df.columns = ["col 1", "col 2", "col 3"]

NameError: name 'df' is not defined

In [36]:
import pandas as pd


df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]])


df.index = ["fila 1", "fila 2", "fila 3", "fila 4"]
df.columns = ["col 1", "col 2", "col 3"]

In [37]:
import pandas as pd


df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]])


df.index = ["fila 1", "fila 2", "fila 3", "fila 4"]
df.columns = ["col 1", "col 2", "col 3"]